## Plan Result (terraform/container_registry)

[CI link](https://github.com/nakashima-yuta23-fixer/github_actions_triger_terraform/actions/runs/10765376195)



<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.container_registry.azurerm_container_registry.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.container_registry.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "acrnytes1dvje"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-nytes1-dev-je"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"merge-trigger","PRNumber":7,"Program":"tfcmt","SHA1":"5a4e269e93a981ee31873fe64a99074ef75f19c7","Target":"terraform/container_registry","Vars":{},"WorkflowName":"Merge trigger"} -->